/*
    RF更新日志：2017年-7-25日
    上海上嘉_2017-07-25-23-10.apk

    1、混载收货，混载上架。
        扫描录入预检单之后 可以点选是否混载收货。
        （默认是不混载，混载收货收错了数量后台现阶段不可修改，提醒收货人员多多注意）

    2、拣货拉取顺序调整为按拣货位升序拉取，
        之前说的跳行 可能是货位排列不是升序导致的 导致货位左一个右一个，现在货位是依次拉取。

    3、晚上我会发出新的RF更新包，明天早上更新后台程序。
*/


/*
    RF紧急更新日志：2017年-7-26日
    上海上嘉_2017-07-26-15-48.apk

    拣货锁定容器失败修复
*/


/*
    RF更新日志：2017-7-26日
    版本号：1.3.1
    上海上嘉_2017-07-27-09-28.apk

    1、混载模式收货，如果扫描到不可混载商品会有提示。

    2、需要混载收货的商品需要将收货模式配置为：
        “1-不同货品可混载，相同货品不同批号不可混载”

    3、刘学峰说的 混载上架后不可移库的问题。（这个今天测试，昨天一直在测试越库）

    4、预留通知接口。定时任务。

    5、修复收货时意外闪退问题
*/


/*
    RF紧急更新日志：2017年-7-27日
    上海上嘉_2017-07-27-13-56.apk
    
    卸载重新安装后 可以消去：当当当
*/


/*
    RF更新日志：2017年-7-80日
    版本号：1.3.2
    上海上嘉_2017-07-30-02-20.apk
    
    解决推荐货位是‘00000000’或者等于‘拣货位’的问题。
    
*/


/*
    RF更新日志：2017年-7-31日
    版本号：1.3.2
    上海上嘉_2017-07-31-12-15.apk
    
    解决拣货位没有库存情况下，库存查询崩溃😖的问题。
    可酌情更新
*/


/*
    RF更新日志：2017年-8-3日
    版本号：1.3.2
    上海上嘉_2017-08-01-16-11.apk
    
    零头修正现在支持零头，例如：一箱零5瓶（1+5），5瓶（0+5）
    服务器已经更新，可随时更新使用。
*/